# SQL-5 

## Integrity 
---

### Prepare the environment

In [1]:
pip install ipython-sql psycopg2

Requirement already satisfied: ipython-sql in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (0.5.0)
Requirement already satisfied: psycopg2 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (2.9.9)
Requirement already satisfied: prettytable in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython-sql) (8.20.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython-sql) (2.0.9)
Requirement already satisfied: sqlparse in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: decorator in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: exceptiongroup in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython->ipython-sql) (1.2.0)
Requirement already satisfied: colorama in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing>=1.2.0 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\ayushman kumar singh\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2 -> 23.3.2
[notice] To update, run: C:\Users\Ayushman kumar singh\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [2]:
%load_ext sql

**Note** For this activity make sure to drop and create a new `cricdb` database. Run the following command from postgres commandline.

postgres# `drop database if exists cricdb;`

postgres# `create database cricdb;`

In [3]:
%sql postgresql://postgres:ed4bdc3d@localhost:5432/cricdb

In [9]:
%sql drop  table  if exists team cascade

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [10]:
%%sql create table team (
    team_id integer,
    team_name varchar(50) not null,
    team_owner varchar(50) not null,
    primary key (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [11]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [12]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer,
    primary key (player_id),
    unique(player_id, dob),
    check (dob > '1980-01-31'),
    foreign key (team_id) references team (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [13]:
%%sql insert into team values
    (101, 'Mumbai Indians', 'Reliance Industry Ltd'),
    (102, 'Chennai Super Kings', 'India Cements Ltd'),
    (103, 'Delhi Capitals', 'JSW Sports')
    ;

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[]

In [14]:
%%sql insert into player values
    (1, 'Hardik', 'Pandya', '1993-10-11', 101),
    (2, 'MS', 'Dhoni', '1981-07-07', 102),
    (3, 'Rohit', 'Sharma', '1987-04-30', 101),
    (4, 'Ruturaj', 'Gaikwad', '1997-01-31', 102);

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[]

In [15]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[(101, 'Mumbai Indians', 'Reliance Industry Ltd'),
 (102, 'Chennai Super Kings', 'India Cements Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports')]

In [16]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 102),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 102)]

**Note:** Observe the behaviour when deleting tuples from the `team` table

In [17]:
%sql delete from team where team_id = 102;

# violation of foreign key consteriants

 * postgresql://postgres:***@localhost:5432/cricdb
(psycopg2.errors.ForeignKeyViolation) update or delete on table "team" violates foreign key constraint "player_team_id_fkey" on table "player"
DETAIL:  Key (team_id)=(102) is still referenced from table "player".

[SQL: delete from team where team_id = 102;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [18]:
%sql delete from team where team_id = 103;

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

**Note** The above scenarios illustrate the default behaviour when having a referential integrity  constraint.

---

### No action/Set null

In [19]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [20]:
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [21]:
%%sql create table team (
    team_id integer,
    team_name varchar(50) not null,
    team_owner varchar(50) not null,
    primary key (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [22]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer,
    primary key (player_id),
    unique(player_id, dob),
    check (dob > '1980-01-31'),
    foreign key (team_id) references team (team_id) 
    on delete set null
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

now-> on delete no action

In [41]:
%%sql insert into team values
    (101, 'Mumbai Indians', 'Reliance Industry Ltd'),
    (102, 'Chennai Super Kings', 'India Cements Ltd'),
    (103, 'Delhi Capitals', 'JSW Sports')
    ;

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[]

In [42]:
%%sql insert into player values
    (1, 'Hardik', 'Pandya', '1993-10-11', 101),
    (2, 'MS', 'Dhoni', '1981-07-07', 102),
    (3, 'Rohit', 'Sharma', '1987-04-30', 101),
    (4, 'Ruturaj', 'Gaikwad', '1997-01-31', 102);

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[]

In [25]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[(101, 'Mumbai Indians', 'Reliance Industry Ltd'),
 (102, 'Chennai Super Kings', 'India Cements Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports')]

In [26]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 102),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 102)]

In [27]:
%sql delete from team where team_id = 102;

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

In [28]:
%sql select * from player;


# Has consequence on the foreigns table

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), None),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), None)]

---
### CASCADE

In [37]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [38]:
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [39]:
%%sql create table team (
    team_id integer,
    team_name varchar(50) not null,
    team_owner varchar(50) not null,
    primary key (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [40]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer,
    primary key (player_id),
    unique(player_id, dob),
    check (dob > '1980-01-31'),
    foreign key (team_id) references team (team_id) 
    on delete cascade
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [43]:
%sql delete from team where team_id = 102;

 * postgresql://postgres:***@localhost:5432/cricdb
1 rows affected.

[]

In [44]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101)]

In [57]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(101, 'Mumbai Indians', 'Reliance Industry Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports')]

---
### Set Default

In [65]:
%sql drop table if exists player

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [66]:
%sql drop table if exists team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [67]:
%%sql create table team (
    team_id integer,
    team_name varchar(50) not null,
    team_owner varchar(50) not null,
    primary key (team_id)
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [68]:
%%sql create table player (
    player_id integer not null,
    first_name varchar(25) not null,
    last_name varchar(25) not null,
    dob date not null,
    team_id integer DEFAULT 101,
    primary key (player_id),
    unique(player_id, dob),
    check (dob > '1980-01-31'),
    foreign key (team_id) references team (team_id) 
    on delete set default
)

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [69]:
%%sql insert into team values
    (101, 'Mumbai Indians', 'Reliance Industry Ltd'),
    (102, 'Chennai Super Kings', 'India Cements Ltd'),
    (103, 'Delhi Capitals', 'JSW Sports')
    ;

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[]

In [50]:
%%sql insert into player values
    (1, 'Hardik', 'Pandya', '1993-10-11', 101),
    (2, 'MS', 'Dhoni', '1981-07-07', 102),
    (3, 'Rohit', 'Sharma', '1987-04-30', 101),
    (4, 'Ruturaj', 'Gaikwad', '1997-01-31', 102);

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[]

In [51]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 102),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 102)]

In [52]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
3 rows affected.

[(101, 'Mumbai Indians', 'Reliance Industry Ltd'),
 (102, 'Chennai Super Kings', 'India Cements Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports')]

In [55]:
%sql delete from team where team_id = 102;

 * postgresql://postgres:***@localhost:5432/cricdb
0 rows affected.

[]

In [56]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 101)]

In [57]:
%sql select * from team

 * postgresql://postgres:***@localhost:5432/cricdb
2 rows affected.

[(101, 'Mumbai Indians', 'Reliance Industry Ltd'),
 (103, 'Delhi Capitals', 'JSW Sports')]

---
### Drop table

In [62]:
%sql drop table if exists team;

# because table palyer has foreign key reference from team

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [63]:
%sql drop table if exists team cascade

 * postgresql://postgres:***@localhost:5432/cricdb
Done.

[]

In [64]:
%sql select * from player

 * postgresql://postgres:***@localhost:5432/cricdb
4 rows affected.

[(1, 'Hardik', 'Pandya', datetime.date(1993, 10, 11), 101),
 (3, 'Rohit', 'Sharma', datetime.date(1987, 4, 30), 101),
 (2, 'MS', 'Dhoni', datetime.date(1981, 7, 7), 101),
 (4, 'Ruturaj', 'Gaikwad', datetime.date(1997, 1, 31), 101)]

\c cricdb
\d player

Q: What is the schema of the relation `player`?

`cricdb# \d player;`